#include "Header.h"
import geometry;

//________________________________________________Questions_Tasks__________________________________________________________________________//
// need do define on 1/2/3 -> 1D/2D/3D ??

//_________________________________________________________________________________________________________________________________________//


int main ()
{
    return 0;
}


//_________________________________________________________________________________________________________________________________________//
// получаем 2 треугольника с requires 3d
// строим плоскости по ним, точнее нормаль берем - 
// - получаем две нормали - 
// векторное произведение нормалей = линия пересечения двух плоскостейй треугольник

// счиатем расстояние от точек треугольника до другой плоскости
// если все одного знака -> выход из фукнции (кроме нуля )

// второй треугольник аналогично

// из расстояний находим через отношения точки которые лежат на прямой пересечения

// рассматриваем 2д случай

// template <std::size_t Dimension>
// constexpr bool Moller_alg (const Triangl<Dimension>& tr_1, const Triangl<Dimension>& tr_2) noexcept requires (Dimension == 3)
// {

// }


//_________________________________________________________________________________________________________________________________________//
