#include "Header.h"


int main ()
{

    return 0;
}


// 3 points + S + 3 lines
class Triangl
{};


// 2 points + po + k/b
class Line
{
    // функция построения прямых по точкам // и по коэфициентам сразу = инициализация
};


//________________________________________________Questions_Tasks__________________________________________________________________________//
// S_func (massive of points)
// поиск площади по точкам: перегрузка в зависимости от количества переданных параметров площадь считается по разному
// или площадь это сумма треугольничков которые через векторное произведение считаются

// func
// нахождение точек пересечения по двум прямым 
// if есть бесконечное пересечение, тогда берем 2 точки лежащие на обоих прямых
// (то есть берем последовательно 4 точки двух линий и проверяем лежит ли каждая на обеих прямых одновременно)


// 1 - строим все прямые отдельных треугольников y=kx+b                                                        {        ро`        }
// 2 - находим все точки пересечения разных прямых треугольников +delete лишние точки, лежащие дальше чем ро ( .------.------------.)
//                                                                                                               ро
// -> получаем массив точек: удаляем одинаковые
// отправляем точки в функцию расчета площади
//_________________________________________________________________________________________________________________________________________//
